{
	"label": "SoloDark",
	"entries": {
		"SoloDark": {
			"name": "SoloDark",
			"pages": {
				"Solo Gameplay": {
					"name": "Jogo Solo",
					"text": "<p>Seja bem-vindo(a) a SoloDark, as regras para o jogo solo de Shadowdark RPG!</p> <p>Como um jogador solo, você interpreta o papel dos personagens e também do Mestre do Jogo.</p> <p>E assim como em qualquer jogo, você não quer saber o que vai acontecer desde o início. Então você vai precisar de uma maneira de responder às perguntas que normalmente seriam respondidas pelo MJ.</p> <p>Este livreto lhe fornece as tabelas para fazer isso:</p> <h2>ORÁCULO</h2> <p>Use o Oráculo para responder às perguntas de “sim” ou “não” sobre o mundo de jogo. Por vezes, você terá respostas inesperadas ou uma reviravolta! Veja a tabela na pág. 13.</p> <h2>COMANDOS</h2> <p>Use os comandos para gerar ideias ou responder às demais perguntas. Veja a tabela na pág. 14. Role um verbo + substantivo para gerar um resultado para uma ideia ou resposta.</p> <h2>REGRAS MODIFICADAS</h2> <p><em>SoloDark</em> modifica algumas das regras normais do Shadowdark RPG.</p> <p><strong>Iniciativa em Grupo.</strong> Escolha um personagem e um inimigo para fazer os testes de iniciativa em nome dos seus respectivos grupos.</p> <p>Você decide a ordem das ações no turno de cada grupo, que pode ser diferente de rodada para rodada.</p> <p><strong>Modo Caos.</strong> Role novamente a iniciativa no início de cada rodada de combate (use a iniciativa em grupo).</p> <p><strong>Luz.</strong> As fontes de luz duram 10 rodadas cada, em vez de 1 hora de tempo real.</p> <p><strong>Sorte.</strong> Se você rolar um 20 natural, ganhe um token de sorte.</p> <p>A quantidade de tokens de sorte que você pode ter é igual à quantidade de PJs em seu grupo.</p> <p>É importante notar que você não pode rolar novamente os resultados “fora do jogo”, como os testes do Oráculo ou rolagens de talento.</p>"
				},
				"Getting Started": {
					"name": "Iniciando",
					"text": "<h2>PERSONAGENS</h2> <p>O foco do seu jogo está nos personagens do jogador (PJs) — aventureiros com níveis de classe.</p> <p>Gere novos PJs com as regras-padrão do Shadowdark RPG para a criação de personagens.</p> <p><strong>Sorte Favorável.</strong> Novos PJs começam com um token de sorte.</p> <p>É recomendável que seu grupo tenha de 2 a 4 PJs: se houver mais do que quatro, pode ser difícil controlá-los.</p> <p>Se você quiser ter apenas um PJ em seu grupo, considere iniciar o jogo em um nível mais alto.</p> <h2>COMECE!</h2> <p>Você pode adentrar em uma das masmorras prontas e usar o Oráculo para ajudá-lo a decidir as escolhas de seus PJs. Ou então você pode criar uma nova aventura do zero (obtenha ideias na pág. 10).</p> <p>Veja as págs. 3 e 4 para exemplos de jogo e recursos adicionais</p>"
				},
				"Solo Examples": {
					"name": "Exemplos de Solo",
					"text": "<h2>Youtube</h2> <ul> <li> <p><strong>The Arcane Library.</strong> Kelsey joga Shadowdark RPG com as regras solo de SoloDark.</p> </li> <li> <p><strong>Night Noon Games.</strong> Michael joga Shadowdark RPG com o baralho de cartas Emulador de Mestre Mythic.</p> </li> <li> <p><strong>Me, Myself and Die!</strong> Trevor Devall, um dublador profissional, joga Broken Empires RPG (seu jogo autoral), Savage Worlds (com o Emulador de Mestre Mythic), Five Parsecs From Home (sistema solo), e muito mais!</p> </li> <li> <p><strong>Geek Gamers.</strong> Muitas ideias e exemplos de jogos criativos com inúmeros sistemas e suplementos.</p> </li> <li> <p><strong>Wizard Deadloss.</strong> O mago usa as regras de D&D BECMI para jogar aventuras clássicas, que incluem The Keep on the Borderlands e The Veiled Society. Ele usa um sistema solo simples de d6.</p> </li> <li> <p><strong>Kill Ten Rats RPG.</strong> Jogo solo minimalista e amigável com Knave, Black Sword Hack, Ironsworn e outros sistemas.</p> </li> </ul> <h2>Blogs</h2> <ul> <li> <p><strong>Castle Grief</strong>. Jogos solo com uma variedade de sistemas old-school. Recursos, relatos de sessões e materiais originais incríveis desenhados à mão!</p> </li> <li> <p><strong>Chaoclypse.</strong> Guias, arte, teoria de design de jogos e resenhas de sistemas.</p> </li> <li> <p><strong>Lone Horizons.</strong> Relatos de sessões, vídeos de jogos solo e recursos.</p> </li> <li> <p><strong>The Soloist.</strong> Notícias, recursos e resenhas de todos os tipos de RPGs solo.</p> </li> </ul> <h2>Podcasts</h2> <ul> <li> <p><strong>The Lone Adventurer.</strong> Narração fantástica de jogos solo com 5E.</p> </li> <li> <p><strong>Solo Dungeon Crawler.</strong> Jogo solo com o D&D Original que se passa em tempo real.</p> </li> </ul> <h2>Social Media</h2> <ul> <li> <p><strong>r/Solo_Roleplay.</strong> Uma comunidade amigável que oferece conselhos, recursos e relatos de sessões.</p> </li> </ul>"
				},
				"I Need A...": {
					"name": "Preciso de Um/Uma...",
					"text": "<h2>MONSTRO</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em português por LaserHead, págs. 191–195</p> </li> <li> <p><strong>The Monster Overhaul,</strong> por Skerples.</p> </li> <li> <p><strong>Index Card RPG: Master Edition,</strong> de Runehammer Games, págs. 382-383.</p> </li> <li> <p><strong>Knave 2E,</strong> por Ben Milton, págs. 64-67.</p> </li> </ul> <h2>PNJ</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em português por LaserHead, págs. 126–131.</p> </li> <li> <p><strong>Knave 2E,</strong> págs. 53-59.</p> </li> <li> <p><strong>Masks - 1,000 Memorable NPCs,</strong> pelos autores do GnomeStew.com.</p> </li> <li> <p><strong>UNE, The Universal NPC Emulator Revised,</strong> por Zach Best.</p> </li> </ul> <h2>TESOURO</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em português por LaserHead, págs. 276–283.</p> </li> <li> <p><strong>Index Card RPG: Master Edition,</strong> págs. 384-398.</p> </li> <li> <p><strong>Ensorcelled Loot Deck,</strong> por Philip Reed.</p> </li> </ul> <h2>Encounter</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em português por LaserHead, págs. 144–187</p> </li> <li> <p><strong>City Encounters for Swords & Wizardry,</strong> por Matt Finch.</p> </li> <li> <p><strong>Deck of Old-School Encounters,</strong> por Philip Reed.</p> </li> </ul> <h2>Dungeon</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em portuguê</p> </li> <li> <p><strong>The Gardens of Ynn</strong> e <strong>The Stygian Library,</strong> por Emmy Allen.</p> </li> <li> <p><strong>Tome of Adventure Design (Revised),</strong> por Matt Finch, capítulo três.</p> </li> <li> <p><strong>Axebane's Deck of Many Dungeons.</strong></p> </li> <li> <p><strong>Knave 2E,</strong> págs. 14-17.</p> </li> </ul> <h2>ERMO</h2> <ul> <li> <p><strong>Shadowdark RPG,</strong> de The Arcane Library, edição em português por LaserHead, págs. 134–135.</p> </li> <li> <p><strong>The Hexanomicon #1,</strong> por Zariel Kuri.</p> </li> <li> <p><strong>Sandbox Generator,</strong> por Atelier Clandestin.</p> </li> <li> <p><strong>Tarvannion,</strong> por Castle Grief.</p> </li> </ul>"
				}
			}
		}
	}
}
