{
	"label": "Documentação",
	"entries": {
		"Release Notes": {
			"name": "Notas de Versão",
			"pages": {
				"Release Notes": {
					"name": "Notas de Versão",
					"text": "<h1>Tradução</h1><ul><li>Tradução desse documento e de todo o compêndio do Shadowdark feito por <a href='https://github.com/renanb4/'>renanb4</a>.</li><li>Link do Github: <a href='https://github.com/renanb4/traducao-compendium-shadowdark-ptbr'>Clique aqui!</a></li></ul><h1>v3.6.0</h1><h2>Correções de bugs</h2><ul><li>[#1097] Imagem em miniatura corrompida para cena importada da aventura de início rápido</li><li>[#1098] Menus de contexto não exibidos para jogadores na versão 13</li><li>[#1104] Texto claro sobre fundo branco nas páginas do diário</li></ul> <h2>Tarefas</h2> <ul><li>[#1099] Mesclar atualizações da tradução em russo do Crowdin</li></ul><p><strong>NOTA:</strong> A partir desta versão, só oferecemos suporte ao FoundryVTT v13</p><hr><h1>v3.5.0</h1><h2>Melhorias</h2><ul><li>[#1074] Adicionado suporte básico para Foundry v13</li><li>[#1093] O preCreate do Actor deve definir um token personalizado na criação, se não houver um definido nos dados</li></ul><h2>Correções de bugs</h2><ul><li>[#1067] Corrigido o ataque Will O Wisp</li><li>[#1070] O importador de itens falha para nomes que não estão em maiúsculas</li><li>[#1085] A habilidade especial não é deduzida se a caixa de diálogo de rolagem for cancelada</li><li>[#1089] Corrigido o talento “Ignorar todo o dano“ do Lutador de Fossa na tabela de rolagem da classe</li><li>[#1091] A posição do HUD de efeitos não está vinculada ao tamanho do painel direito do Foundry</li><li>[#1092] A macro de importação de feitiços cria itens de feitiço com o token padrão do ator como imagem</li><li>[#1094] Peso da fonte da mensagem de pausa muito forte na v13</li></ul><h2>Tarefas</h2><ul><li>[#1083] Mesclar atualizações de tradução em chinês tradicional e francês do Crowdin</li></ul><hr><h1>v3.4.6</h1><h2>Correções de bugs</h2><ul><li>[#1080] Configuração incorreta do idioma de localização i18n chinês</li></ul><h2>Tarefas</h2><ul><li>[#1079] Mesclar atualizações da tradução finlandesa do Crowdin</li></ul><p><em>Mais uma vez, muito obrigado a <strong>Han_G_FaYa</strong> pela ajuda com a configuração da tradução para <strong>chinês tradicional</strong>.</em></p><hr><h1>v3.4.5</h1><h2>Melhorias</h2><ul><li>[#1075] Adicionado “chinês tradicional“ como idioma do sistema totalmente traduzido</li></ul><h2>Tarefas</h2><ul><li>[#1073] Mesclar atualizações de tradução para “chinês tradicional“ do Crowdin</li></ul> Muito obrigado a Han_G_FaYa por contribuir com os dados de tradução para o chinês tradicional. <hr><h1>v3.4.4</h1><h2>Correções de bugs</h2><ul><li>[#1061] Faltam rótulos no Gerador de Personagens e na Importação de Shadowdarkling</li><li>[#1063] Página de estatísticas na ordem errada no Guia de Início Rápido do Jogador</li><li>[#1064] Problema tipográfico na página de estatísticas do Guia Rápido do Jogador (Inteligência)</li></ul> <h2>Tarefas</h2> <ul><li>[#1062] Mesclar atualizações da tradução em francês do Crowdin</li></ul><hr><h1>v3.4.3</h1><h2>Correções de bugs</h2><ul><li>[#1059] Rolagens de armas não versáteis acionadas a partir de cartas de bate-papo de itens falham</li></ul><hr><h1>v3.4.2</h1><h2>Correções de bugs</h2><ul><li>[#1056] Rolagem sem arma com defeito</li></ul><h2>Tarefas</h2><ul><li>[#1054] Mesclar atualizações das traduções em francês e português brasileiro do Crowdin</li><li>[#1055] Mesclar atualizações da tradução francesa do Crowdin</li></ul><hr><h1>v3.4.1</h1><h2>Melhorias</h2><ul><li>[#897] Verificar se o ataque foi bem-sucedido quando um ator é alvejado <em>(muito obrigado a <strong>ashleytowner</strong> por contribuir com esta correção de bug)</em></li> Adicionar a capacidade de realizar facilmente testes de foco em feitiços (muito obrigado a ashleytowner por contribuir com esta melhoria). </ul> <h2>Correções de bugs</h2> <ul> [#1036] Página de estatísticas ausente (página 15) no guia rápido do jogador <li>[#1038] Faltam strings traduzíveis</li><li>[#1039] Os botões “Aplicar dano“ e “Aplicar cura“ não aparecem mais <em>(muito obrigado a <strong>ashleytowner</strong> por contribuir com esta correção de bug)</em></li><li>[#1047] A macro da barra de atalhos não causa mais dano</li> O recurso “Estátua“ está faltando na Armadura Animada Não é possível rolar ataques versáteis com armas a partir do cartão de bate-papo do item </ul> <h2>Tarefas</h2> <ul><li>[#1043] Mesclar atualizações da tradução em francês do Crowdin</li></ul><hr><h1>v3.4.0</h1><h2>Melhorias</h2><ul><li>[#974] As habilidades da classe base agora serão adicionadas automaticamente aos novos personagens ao serem criados e importados</li><li>[#978] Role apenas o tipo de dano solicitado para armas versáteis</li><li>[#1001] Nova configuração para limitar a visualização dos jogadores do tempo restante nas fontes de luz</li> Adicionar a habilidade de classe “Teletransportar para Familiar“ para a Bruxa. <li>[#1018] Não use “bem-sucedido“ ao usar habilidades de classe que não exigem rolagem</li></ul> <h2>Correções de bugs</h2> <ul><li>[#970] Efeitos ativos atualizados em Efeitos de Feitiço: Arma Sagrada <li>[#998] Estatísticas do gerador de personagens não traduzíveis</li><li>[#999] Corrigidos erros ortográficos de i18n <em>(muito obrigado a <strong>mcDevnagh</strong> por contribuir com essas correções)</em></li><li>[#1004] Bug que impedia a edição do tempo restante da fonte de luz</li><li>[#1005] Remoção do efeito incorreto no talento Teletransporte da Bruxa para o Familiar</li><li>[#1020] Efeitos incorretos na espada Asterion na aventura inicial</li><li>[#1023] Problema em que os ataques com armas arremessadas não são exibidos corretamente</li><li>[#1029] Erro de digitação na tabela de rolagem de ruínas para a entrada 1d6 cultistas</li><li>[#1031] Mover a ascendência Kobold e os talentos das Regras Básicas para a fonte “Shadowdark RPG: Bard and Ranger“ e renomear para “Shadowdark RPG: Bard, Ranger and Kobold“</li></ul> <h2>Tarefas</h2> <ul><li>[#1019] Mesclar as atualizações da tradução alemã do Crowdin</li><li>[#1032] Atualizar os módulos node usados no processo de compilação para as versões mais recentes</li></ul><hr><h1>v3.3.1</h1><h2>Correções de bugs</h2><ul><li>[#993] A caixa de diálogo para adicionar tesouros não estava sendo renderizada corretamente</li><li>[#995] O importador Shadowdarkling não importava a classe do personagem</li></ul><h2>Tarefas</h2><ul><li>[#992] Mesclar atualizações de tradução i18n do Crowdin</li></ul><hr><h1>v3.3.0</h1><h2>Melhorias</h2><ul><li>[#973] Usar <em>Habilidades Especiais</em> em vez de usar <em>Habilidades de {Nome da Classe}</em> para o título da seção Habilidades de Classe, pois Habilidades Especiais não relacionadas à classe também podem aparecer lá</li> Adicionar a capacidade de definir um alinhamento obrigatório para uma classe. Adicionar nova classe Guerreiro Basilisco (muito obrigado a Kelsey por nos permitir incluir isso no sistema). </ul> <h2>Correções de bugs</h2> <ul> [#976] Impossível excluir itens da bolsa de gemas [#979] Shune, o Vil, ausente da lista de divindades </ul> <h2>Tarefas</h2> <ul><li>[#989] Atualizar pacotes de nós para a versão mais recente para o processo de compilação</li></ul><hr><h1>v3.2.3</h1><h2>Melhorias</h2><ul><li> Permitir a edição dos segundos restantes atuais em uma fonte de luz <ul><li>Os campos da fonte de luz agora podem ser editados, desde que a fonte de luz não esteja ativa no momento</li></ul></li></ul><h2>Correções de bugs</h2><ul><li>[#981] Corrigido um pequeno erro ortográfico em um arquivo de tabela rolltable <em>(muito obrigado a jkwatson por esta contribuição)</em></li><li>[#983] A importação de Shadowdarklings atribui incorretamente o talento “+1 para ataques corpo a corpo e à distância“</li><li>[#985] O bardo não pode lançar feitiços a partir de itens</li></ul> <h2>Tarefas</h2> <ul><li>[#975] Atualizações da tradução francesa do Crowdin foram mescladas</li></ul><hr><h1>v3.2.2</h1><h2>Tarefas</h2><ul><li>[#968] Atualizar o processo de importação de Shadowdarklings para suportar varinhas e pergaminhos</li></ul><hr><h1>v3.2.1</h1><h2>Correções de bugs</h2><ul><li>[#723] Não é possível editar gemas na bolsa de gemas de um personagem</li><li>[#964] Não é possível editar/modificar efeitos ativos em itens</li></ul> <h2>Tarefas</h2> <ul><li>[#962] Mescladas as atualizações da tradução “Português, Brasileiro“ do Crowdin</li></ul><hr><h1>v3.2.0</h1><h2>Melhorias</h2><ul><li>[#657] Consumir munição ao atacar com armas de longo alcance, se necessário</li><li>[#847] Adicionar suporte para a classe Warlock Boon, que dá a habilidade de aprender um feitiço de Wizard</li><li>[#879] Adicionar nova classe de item Patron</li><li>[#880] Criar um novo tipo de Boon Patron para Talentos</li><li>[#881] Suporte para rolagem na tabela de Boon do Patrono de um personagem, se necessário, no aplicativo Level Up</li><li>[#901] Adicionado russo como idioma parcialmente completo do sistema.</li> Adicionar dados roláveis ao feitiço Cure Wounds, incluindo os cálculos necessários (Muito obrigado a nschoenwald por contribuir para esta questão). Adicionado efeito ativo +1 AC Dual Wield ao talento de mesmo nome, que agora pode ser ativado/desativado conforme necessário na ficha do personagem. Implementados links de verificação automática e adicionada nova macro para abrir a caixa de diálogo de solicitação de verificação. <ul><li>exemplo de sintaxe: <code>[[check 12 str]]</code> ou <code>[[request 15 int]]</code></li></ul></li> Mostrar dicas de ferramentas sobre as propriedades das armas e armaduras ao exibir a visualização expandida no inventário. Adicionar maneira de visualizar/manipular os efeitos ativos atuais na guia Efeitos do jogador <li>[#937] Suporte para selecionar ou rolar Patrono no gerador de personagens</li> Adicionar macro para iniciar o gerador de personagens Adicionada nova sintaxe de verificação ao texto nas habilidades dos monstros e na guilda da masmorra Lost Citadel. </ul> <h2>Correções de bugs</h2> <ul><li>[#894] Aviso desnecessário de “itens não encontrados“ para “+2 pontos de estatísticas“ de ShadowDarklings</li> Adicionar preenchimento adicional ao estilo blockquote para que o texto não se misture com as decorações. <li>[#902] Não é possível colar o JSON do Shadowdarklings se o objeto de texto tiver sido copiado anteriormente</li><li>[#903] Importar Wizards de Shadowdarklings retorna erros “Plus2INTOrPlus1Casting“</li><li>[#906] Há sempre um espaço extra entre o nome do ataque especial e o efeito</li><li>[#918] Nomes de atores e tipos de itens ausentes dos dados i18n</li><li>[#919] O modelo de item de classe tem um valor de classe de conjuração de feitiços padrão incorreto</li><li>[#930] As habilidades de classe não podem ser usadas se não tiverem um teste de habilidade associado</li><li>[#936] Gerador de personagens: não exiba alinhamento vazio para divindades que não têm um</li><li>[#938] Quebras de linha desnecessárias nas descrições dos talentos Farsight. [#952] Ataques especiais de NPCs sempre postados no chat público <li>[#953] O Dice So Nice não respeita os modos de rolagem no Shadowdark</li><li>[#955] Ícone de mensagem de chat ausente ao passar o mouse sobre os talentos Ancestry e Level na ficha do personagem</li><li>[#956] Não é possível importar personagens sem nome do Shadowdarklings</li><li>[#959] A descrição do efeito Estimulante tem um link quebrado para um talento de Ranger que foi convertido em uma Habilidade de Classe</li> Adicionar a habilidade de classe Berzerk ausente para a classe Sea Wolf. <li>[#967] A contagem padrão de rodadas para efeitos impede o ajuste em tempo real</li></ul> <h2>Tarefas</h2> <ul><li>[#911] Substituição do mapeamento de arte do compêndio pelo método padrão do Foundry. <em>(As configurações para o mapeamento de arte do compêndio agora se encontram em Configurações &gt; Núcleo &gt; Arte do compêndio)</em></li><li>[#917] Reestruturar os modelos de folhas de itens para torná-los um pouco mais gerenciáveis</li><li>[#924] Realizou uma auditoria dos modelos existentes para garantir que não houvesse nenhuma string bruta que precisasse ser internacionalizada</li><li>[#927] O executor de migração acessa globalThis.duplicate, que agora deve ser acessado via foundry.utils.duplicate</li><li>[#928] Migrar “Deidades“ para o novo compêndio “Padroeiros e Deidades“</li><li>[#929] Atualizações do idioma russo mescladas do Crowdin</li></ul> Muito obrigado a AdamsGH por contribuir com os dados de tradução para o russo. <hr><h1>v3.1.3</h1><h2>Melhorias</h2><ul><li>[#895] Adicionado “Português, Brasileiro“ como idioma do sistema totalmente traduzido.</li></ul><p><em>Muito obrigado a <strong>Felipe Pereira Pinto (Salazar)</strong> por contribuir com os dados de tradução para <strong>português brasileiro</strong>.</em></p><hr><h1>v3.1.2</h1> Correções de erros <ul><li>[#888] HP máximo e atual não definidos corretamente durante a criação do personagem</li></ul><h2>Tarefas</h2><ul><li>[#891] Atualizações do idioma finlandês do Crowdin mescladas</li></ul><hr><h1>v3.1.1</h1><h2>Correções de bugs</h2><ul><li>[#885] Livro de feitiços do personagem mostrando feitiços duplicados e feitiços de classes incorretas no aplicativo Level Up</li></ul><h2>Tarefas</h2><ul><li>[#886] Atualizações i18n mescladas para todos os idiomas do Crowdin</li></ul><hr><h1>v3.1.0</h1><h2>Melhorias</h2><ul><li>[#693] As alterações feitas nos efeitos ativos dos atores agora terão efeito imediato</li><li>[#849] A interface do usuário e a funcionalidade do importador Shadowdarklings foram aprimoradas</li><li>[#853] Estilo CSS para diários</li><li>[#854] Adicionados diários SoloDark, tabelas de rolagem e um novo aplicativo oráculo</li><li>[#856] Revisão estética dos diários Quickstart</li><li>[#874] Adicionadas descrições de classes ao gerador de personagens e a ficha de classe permanece aberta durante a subida de nível</li></ul> <h2>Correções de bugs</h2> <ul><li>[#852] Corrigido um bug em que os ataques à distância não mostravam o dano correto</li> Corrigidos pequenos bugs na interface do usuário. <li>[#858] O Gerador de Personagens agora exibe o texto corretamente no Foundry v12</li><li>[#868] O texto da propriedade “Arremessado“ foi atualizado para corresponder às regras mais recentes.</li><li>[#869] Importador de monstros não funcionando no v12</li><li>[#870] Corrigido um bug relacionado à coleta de fontes de luz caídas</li><li>[#875] Correções nos links da Aventura de Início Rápido e utilização do novo estilo do Diário</li></ul> <h2>Tarefas</h2> <ul><li><p>[#332] Implementação do método v11 para trabalhar com efeitos ativos</p></li><li><p>[#866] Atualizada a documentação README e a mensagem de boas-vindas.</p><ul><li>A mensagem de boas-vindas agora inclui um link para o tutorial em vídeo: <a href=“https://youtu.be/hoBxiK71DBQ“>https://youtu.be/hoBxiK71DBQ</a></li></ul></li><li><p>[#872] Atualizadas as habilidades do Bardo para as definições no PDF Bardo e Caçador v1.3</p></li><li> Muito obrigado a Kelsey, da The Arcane Library, por nos permitir incluir o SoloDark no sistema principal do FoundryVTT. </li><li><p>Agradecemos a <em>Cussa</em> por contribuir com correções nesta versão.</p></li></ul><p><strong>NOTA:</strong> Esta versão marca o fim do suporte para o FoundryVTT v11 e requer o FoundryVTT v12</p><hr><h1>v3.0.0</h1> <h2>Melhorias</h2> <ul><li><p>[#438] Cabeçalho do inventário desaparecendo em inventários grandes</p></li><li><p>[#740] Manter a tecla Shift pressionada agora rola alguns dados sem aviso prévio</p></li><p>[#769] A interface do usuário foi atualizada</p><ul><li>A interface do usuário foi redesenhada com uma nova aparência</li><li>O inventário do personagem agora suporta a reordenação de itens por arrastar e soltar</li><li>Manter a tecla Shift pressionada enquanto clica em um link rolável irá ignorar o prompt de rolagem, rolando com valores normais</li></ul></li><li> Permitir que tokens e rastreadores de combate exibam AC dinâmico. <ul><li><code>system.attributes.ac.value</code> agora sempre mantém o AC atual</li> /ul></li><li> [#820] Todas as pontuações de habilidade agora armazenam um valor total de estatísticas básicas + modificadores. Por exemplo, <code>system.abilities.str.total</code></p></li><li><p>[#833] Implementados lançamentos para ataques especiais de NPCs</p></li></ul> <h2>Correções de bugs</h2> <ul><li>[#757] O ataque especial Life Drain não rola para o ataque</li><li>[#809] Adicionar novos valores <code>grid.distance</code> e <code>grid.units</code> a <code>system.json</code><em>(Compatibilidade com Foundry V12)</em></li> Erro de digitação em <code>description</code> em <code>system.json</code></li><li>[#814] O botão de iniciativa na ficha do jogador não irá mais rolar duas vezes ao repetir a iniciativa</li><li>[#816] Atualizou a descrição do talento Herbalismo do Ranger para a versão mais recente</li><li>[#822] O livro de feitiços agora funciona para o Cavaleiro de St. Ydris e outras classes que usam a lista de feitiços de outra classe</li><li>[#832] Armas brancas com a propriedade “Arremessada“ agora rolam corretamente quando usadas como um ataque à distância. <li>[#835] Atualização da descrição do feitiço Sono para a versão mais recente</li><li>[#837] A CA não era exibida de forma consistente ao adicionar efeitos. <li>[#839] O cálculo do item Free Carry estava errado se você tivesse itens duplicados em vez de apenas usar a quantidade do item</li><li>[#841] Links de itens do compêndio não funcionam mais no Foundry v12</li></ul> <h2>Tarefas</h2> <ul><li><p>[#813] Atualizações do idioma finlandês do Crowdin foram mescladas</p></li><li><p>[#829] Remover todos os Tours</p><ul><li><strong>NOTA:</strong> Descobrimos que os Tours são muito frágeis e difíceis de manter, precisando ser testados/atualizados mesmo quando pequenas alterações são feitas na interface. Portanto, estamos removendo-os e, daqui para frente, utilizaremos métodos alternativos para ensinar o sistema.</li></ul></li><li> Remover o botão Iniciativa de Rolagem da ficha do personagem <ul><li><strong>NOTA:</strong> Como parte do redesenho das fichas de personagem, decidimos que esse recurso não se encaixa muito bem no design e, como a iniciativa pode ser facilmente rolada através do rastreador de combate, ele se tornou desnecessário.</li></ul></li><li> Remover testes de extinção </li></ul> Muito obrigado a <em>andrewbeard</em> por contribuir com correções nesta versão. <hr><h1>v2.2.2</h1><h2>Correções de bugs</h2><ul><li>[#799] O Gerador de Personagens estava gerando estatísticas de personagens incorretamente</li><li>[#802] Fontes de luz contando regressivamente muito rapidamente com vários GMs conectados</li></ul> <h2>Tarefas</h2> <ul><li>[#797] Atualizações do idioma finlandês mescladas do Crowdin</li></ul><hr><h1>v2.2.1</h1><h2>Correções de bugs</h2><ul><li>[#793] O Livro de Feitiços não abre no cliente pesado Foundry: Object.groupBy não é uma função</li></ul><hr><h1>v2.2.0</h1><h2>Melhorias</h2><ul><li>[#763] Tornar attributes.hp primaryTokenAttribute em system.json</li><li>[#765] Implementar diálogo de carregamento genérico que pode ser usado sempre que ocorrer uma pesquisa potencialmente lenta no compêndio</li><li>[#767] Melhoria significativa nos tempos de carregamento ao acessar determinados itens e menus ao hospedar em Forge VTTs</li></ul><h2>Correções de bugs</h2><ul><li>[#780] Uma tela de subida de nível sendo exibida diretamente após a criação de personagens de nível 0.</li><li>[#761] Vantagem no talento Míssil Mágico ausente do item da classe Mago</li><li>[#768] Personagens de nível 1 gerados com 1 hp, apesar do teste de HP</li><li>[#776] DC do feitiço do NPC não é calculado ao converter do feitiço do PC</li><li>[#758] Não é possível arrastar itens de feitiço de luz para as fichas dos jogadores.</li></ul> <h2>Tarefas</h2> <ul><li>[#774] Atualizações do idioma finlandês do Crowdin foram mescladas</li><li>[#762] Garantir que o sistema Shadowdark funcione sem problemas nas versões de desenvolvimento do Foundry V12</li><li>[#784] O auxiliar {{select}} handlebars está obsoleto <em>(compatibilidade com o Foundry V12)</em></li><li>[#785] A opção async para Roll#evaluate foi removida <em>(compatibilidade com o Foundry V12)</em></li><li>[#786] globalThis.mergeObject agora deve ser acessado via foundry.utils.mergeObject <em>(compatibilidade com Foundry V12)</em></li><li>[#787] A instância global AudioHelper está obsoleta <em>(Compatibilidade com Foundry V12)</em></li><li>[#788] CONST.CHAT_MESSAGE_TYPES foi descontinuado em favor de CONST.CHAT_MESSAGE_STYLES <em>(compatibilidade com Foundry V12)</em></li> ActiveEffect#icon foi migrado para ActiveEffect#img (compatibilidade com Foundry V12) </ul><hr><h1>v2.1.0</h1><h2>Correções de bugs</h2><ul><li>[#751] Corrige um problema em que os jogadores não conseguem arrastar feitiços da lista de feitiços da classe.</li><li>[#753] Adicionamos links de rolagem ao texto dos feitiços Bola de Fogo, Raio e Nuvem Mortal.</li></ul> <h2>Melhorias</h2> <ul> Adicionamos efeitos de feitiços de nível superior ao compêndio. </ul><h2>Tarefas</h2><ul><li>[#748] Mesclar atualizações i18n do Crowdin</li></ul> Muito obrigado a <em>cmleinz</em> por contribuir com o código incluído nesta compilação. <hr><h1>v2.0.0</h1> <h2>Correções de bugs</h2> <ul><li>[#715] Os pergaminhos aprendidos não mostram o ícone normal do feitiço</li></ul><h2>Melhorias</h2><ul><li>[#500] Adicionado suporte para subir de nível os personagens. Uma lista de feitiços de classe pode ser aberta na guia de feitiços da ficha do personagem ou na janela de subida de nível.</li> Melhoria no cartão de bate-papo para efeitos. <li>[#690] Todos os monstros das regras básicas estão agora disponíveis no compêndio de monstros.</li><li>[#694] O conteúdo dos Zines 1-3 do Pergaminho Amaldiçoado agora está disponível. Isso inclui novas classes, origens, divindades, talentos, armas, armaduras e feitiços.</li><li>[#696] O conteúdo das regras básicas foi expandido para incluir feitiços de mago e sacerdote de nível 3-5. Todo o conteúdo das regras básicas agora está marcado como “Regras Básicas“ nas configurações de seleção de fonte.</li> Adicionados sons de dados ao Character Builder. <li>[#718] Corrigido um problema em que o idioma “comum“ não carregava corretamente no Gerador de Personagens ao selecionar classes com idiomas fixos.</li><li>[#725] Atualizado o mapeamento de fichas para novos monstros principais.</li><li>[#728] Agora, os itens de feitiço podem ser arrastados para as folhas de NPC para adicionar esse feitiço à lista de feitiços do NPC.</li> Adicionado 1d2 como uma opção para dano de arma. [#733] Modificador Dex negativo não aplicado corretamente a personagens com armadura. Adicionada tabela de nomes aleatórios para ascendência Kobold. <li>[#738] Agora é possível atribuir um peso às ascendências para afetar a chance de rolagem no Gerador de Personagens. As ascendências das regras básicas foram atualizadas para corresponder à tabela de randomização na página 40.</li></ul> Notas sobre recursos Agora, o nivelamento de personagens ocorre por meio de um sistema estruturado de subida de nível que é acionado quando a experiência ganha atinge ou excede o requisito do próximo nível. <ul><li>Todas as jogadas de HP, talentos e seleções de feitiços agora são feitas na janela de subida de nível.</li><li>Seleção de classe ao subir de nível de 0 a 1</li><li>Os itens de classe agora suportam a adição de uma tabela de feitiços conhecidos.</li><li>Um log de auditoria das alterações de nivelamento do personagem pode ser acessado por meio do script na propriedade actor.auditLog</li></ul><hr><h1>v1.8.0</h1><h2>Correções de bugs</h2><ul><li>[#689] Não é possível retornar à página de descrição em uma folha de itens de fundo</li><li>[#703] Erro no criador de personagens ao selecionar a opção Ancestralidade em branco</li><li>[#702] Mostrar aviso no criador de personagens ao gerar um nome sem selecionar ascendência</li></ul> <h2>Melhorias</h2> <ul><li>[#437] Adicionado criador de personagens</li><li>[#681] Adicionada macro Importador de itens</li><li>[#692] Adicionada macro Importador de Feitiços</li><li>[#695] Adicionada a capacidade de ter efeitos em itens de bênção</li><li>[#697] Atualizada a formatação das descrições dos monstros criadas com o importador de monstros.</li><li>[#704] Abrir a ficha do personagem após ela ter sido criada pelo criador de personagens.</li><li>[#705] O criador de personagens deve poder ser usado pelos jogadores sem lhes dar permissão total para criar atores.</li><li>[#708] Se o usuário já tiver permissões ACTOR_CREATE, não use o soquete para fazer o GM criar o personagem</li></ul> Notas sobre recursos Um novo Gerador de Personagens está agora disponível na guia atores. O gerador pode ser usado para criar novos personagens aleatoriamente ou por seleção. Os recursos incluem: <ul> Todas as opções de personagem respeitam os filtros de origem nas configurações do RPG Shadowdark. <li>Os nomes dos personagens são aleatórios por meio de uma tabela de rolagem vinculada com base na ancestralidade selecionada</li><li>Os personagens de nível 1 ainda exigem rolagem manual e adição de talentos e feitiços de primeiro nível</li></ul> Muito obrigado a <em>arcos</em> e <em>chrpow</em> por contribuírem com o código incluído nesta versão. <hr><h1>v1.7.6</h1><h2>Correções de bugs</h2><ul><li>[#685] AC calculado incorretamente quando apenas um escudo está equipado</li></ul><hr><h1>v1.7.5</h1><h2>Correções de bugs</h2><ul><li><p>[#658] Domínio da armadura não acumulável</p></li><li><p>[#662] Vários lançamentos por PC com iniciativa no sentido horário ativada</p><ul><li>Não permitir o lançamento da iniciativa e mostrar uma mensagem de aviso informando que apenas os GMs podem lançar a iniciativa quando a iniciativa no sentido horário estiver ativada.</li></ul></li><li> Equipar Braçadeiras de Defesa desequipa outras armaduras. <ul><li>Removida a restrição ao número de peças de armadura que podem ser equipadas e alterado o item Braçadeiras de Defesa para fornecer apenas um bônus de CA (sem usar efeitos, de modo que será desativado quando desequipado). Se apenas peças de armadura que não fornecem um nível básico de CA estiverem equipadas, então a CA básica de 10+DEX será usada, de modo que personagens sem armadura podem equipar as Braçadeiras de Defesa para obter o bônus desejado. </ul></li></ul><hr><h1>v1.7.4</h1><h2>Correções de bugs</h2><ul><li>[#656] Erro ortográfico no Guia de Início Rápido do Jogador</li><li>[#666] Corrigido um erro no importador de monstros em que espaços à direita podiam causar falha na análise</li><li>[#668] Erro ortográfico na descrição do feitiço Sleep</li><li>[#671] Fórmula de HP do NPC incorreta</li> Corrigido o item mágico Bag of Holding no compêndio shadowdark. Corrigido um problema com a importação de sacerdotes do shadowdarklings.net </ul><hr><h1>v1.7.3</h1> <h2>Correções de bugs</h2> <ul><li>[#660] Corrigidos links quebrados no Compêndio</li></ul><h2>Tarefas</h2><ul><li>[#661] Mesclar as últimas traduções em coreano e francês do Crowdin</li></ul> Muito obrigado a pyrige por contribuir com o código incluído nesta versão. <hr><h1>v1.7.2</h1> <h2>Correções de bugs</h2> <ul><li>[#650] O novo suporte à barra de atalhos interrompe o suporte padrão ao arrastar documentos para a barra de atalhos</li></ul><h2>Melhorias</h2><ul><li>[#649] Aplicar filtragem de fonte do compêndio aos seletores nas folhas de itens, bem como nas folhas dos jogadores</li> Permitir que itens de feitiço sejam arrastados da ficha do personagem para a barra de atalhos. </ul><hr><h1>v1.7.1</h1><h2>Correções de bugs</h2><ul><li>[#640] Impossível substituir ou adicionar bônus à classe de armadura por meio de efeitos ativos</li><li>[#642] Configuração da duração da “rodada“ definida para 6 minutos em vez de 6 segundos</li><li>[#645] Ocasionalmente, os efeitos predefinidos parecem não carregar/estar disponíveis</li> [#647] A guia Feitiços não é renderizada para a classe Mago na primeira vez que você abre a ficha do personagem </ul> <h2>Melhorias</h2> <ul> Adicionar suporte para durações de “Turno“ em Feitiços/Efeitos (usando 10 minutos como duração) <li>[#646] Tornar a CD base de conjuração personalizável por classe</li></ul><hr><h1>v1.7.0</h1> <h2>Correções de bugs</h2> <ul><li>[#618] Corrigido um bug no Importador de Monstros, onde ataques especiais eram importados sem descrições</li><li>[#620] Mostrar uma notificação de erro se nenhum token for selecionado ao usar itens da barra de atalhos</li><li>[#622] Corrigido um problema ao importar monstros com valores de dano estáticos através do Monster Importer</li> <h2>Melhorias</h2> <ul><li>[#590] Suporte opcional para iniciativa “no sentido horário“</li><li>[#616] Detecção aprimorada do alcance dos feitiços dos NPCs ao importar através do importador de monstros</li><li>[#625] Adicionada sintaxe de jogadas de dados às descrições das habilidades dos monstros ao importar através do importador de monstros</li> Adicionada a capacidade de filtrar fontes de itens no nível das configurações do jogo para que não estejam disponíveis para seleção nas fichas de personagens. Exibição das notas de lançamento do sistema na primeira vez que você abre um mundo em uma nova versão. </ul> <h2>Tarefas</h2> <ul><li>Mesclou novas traduções contribuídas em francês, espanhol e sueco do Crowdin</li></ul><h2>Notas sobre recursos</h2><h3>Suporte para fontes definidas por módulo</h3><p>Os criadores de módulos podem adicionar seus próprios nomes de fontes personalizadas, que ficarão disponíveis no sistema, criando uma seção de configuração personalizada na seção <code>flags</code> do arquivo de configuração <code>module.json</code>. Por exemplo:</p><pre><code>“flags“: { “shadowdark“: { “fontes“: { “&lt;source_uuid&gt;“: “&lt;source_name&gt;“ } } } </code></pre><p>Onde <code>&lt;source_uuid&gt;</code> é um identificador exclusivo para sua fonte personalizada e <code>&lt;source_name&gt;</code> é o nome legível/exibido da sua fonte.</p><h2>Agradecimentos</h2> Muito obrigado a <em>chrpow</em> por contribuir com o código incluído nesta compilação. <hr><h1>v1.6.2</h1><h2>Correções de bugs</h2><ul><li>[#610] A opção de facada pelas costas do ladrão agora é exibida na caixa de diálogo ao usar armas de longo alcance.</li></ul><hr><h1>v1.6.1</h1><h2>Correções de bugs</h2><ul><li>[#601] Corrigido um bug que fazia com que os danos causados por NPCs fossem sempre considerados críticos. Atualizado o importador de monstros para adicionar corretamente a fórmula de rolagem de NPCs.</li></ul> <h2>Tarefas</h2> <ul><li>Mesclou traduções suecas contribuídas pelo Crowdin</li></ul><h1>v.1.6.0</h1><h2>Correções de bugs</h2><ul><li>[#573] Corrigido um problema em que os bônus de ataque dos itens não eram calculados se adicionados manualmente através da caixa de diálogo de rolagem.</li><li>[#580] Aprender um feitiço a partir de um pergaminho não detecta que o jogador cancelou o lançamento.</li><li>[#581] A habilidade de conjuração usada para aprender feitiços era codificada, mas deveria ser dinâmica para suportar classes personalizadas/caseiras.</li><li>[#582] O token Grick é chamado de “Monstro“.</li> O analisador Regex em MonsterImporterSD.mjs não consegue lidar com ataques que têm “+“ no nome. Não é possível arrastar o ator para a barra de atalhos e abrir a ficha do personagem. </ul> <h2>Melhorias</h2> <ul> Adicionada a capacidade de arrastar ataques, feitiços, habilidades, poções e fontes de luz para a barra de atalhos. Adicionado tipo de ataque especial aos NPCs. O importador de monstros agora adiciona ataques especiais. Adicionadas habilidades de conjuração de feitiços e feitiços aos NPCs. O importador de monstros agora adiciona feitiços. <li>[#566] Alerta os jogadores quando eles tentam aprender um feitiço que é de uma classe diferente.</li><li>[#578] Padronizou a iconografia de conjuração de feitiços.</li> Adicionar efeito de talento predefinido que permite a adição de um dado de dano extra a armas com tags específicas. Adicionar efeito de talento predefinido que permite que o dado de dano extra para armas com tags específicas seja aumentado por categoria (weaponDamageExtraDieImprovementByProperty). Adicionar efeito de talento predefinido que permite que o dado de dano para armas com tags específicas seja aumentado por categoria (weaponDamageDieImprovementByProperty). <li>[#596] Mudar o número de ataques do NPC para texto, a fim de suportar macros de rolagem dentro de strings de ataque</li></ul> <h2>Tarefas</h2> <ul> Melhorias nos fluxos de trabalho do GitHub relacionados à criação de uma versão </ul><p><em>Dêem as boas-vindas ao Prototype à equipe de desenvolvimento do sistema Shadowdark</em></p> Muito obrigado a chrpow por contribuir com o código incluído nesta versão. <h1>v.1.5.1</h1> <h2>Correções de bugs</h2> <ul><li>[#560] Mais correções em Tours (Rastreamento de fonte de luz, A Cidadela Perdida e Importação de monstros) (Protótipo)</li><li>[#568] O cálculo de HP do NPC está usando +1 de bônus mínimo de CON em vez de 1 ser o HP mínimo</li></ul><h2>Melhorias</h2><ul> Preparar os dados do ator automaticamente, em vez de esperar que a ficha do personagem seja aberta </ul><h1>v.1.5.0</h1><h2>Correções de erros</h2><ul><li>[#556] Visitas guiadas não funcionando</li></ul><h2>Melhorias</h2><ul><li>[#557] Adicionada ferramenta para ajudar na importação de monstros, que pode ser iniciada por uma nova macro (consulte o compêndio de macros e o novo tour)</li></ul> Muito obrigado ao Prototype por contribuir com o código incluído nesta versão. <h1>v.1.4.10</h1> <h2>Correções de bugs</h2> <ul><li>[#548] Seletor de armadura de classe mostrando itens de armadura não básicos no seletor</li><li>[#549] Pergaminhos e varinhas recém-criados não abrem após a criação inicial</li></ul> <h2>Melhorias</h2> <ul><li>[#184] Agora é possível postar ataques especiais de NPCs no chat clicando neles</li></ul> Muito obrigado ao Prototype por contribuir com o código incluído nesta versão. <h1>v.1.4.9</h1> <h2>Correções de bugs</h2> <ul><li>[#537] O Ranger com o talento de dano D12 sempre rola dois dados de dano, mesmo que a arma não tenha a propriedade Versátil (apenas uma questão estética)</li></ul><h2>Melhorias</h2><ul><li>[#343] Adicionada configuração do mundo para ativar o modo Pulp. Isso alterna o rastreador de sorte na ficha do personagem para entrada numérica em vez de alternância booleana</li> Adicionada a capacidade de indicar que itens físicos estão guardados e não ocupam mais espaços no inventário. Adicionada macro para inicializar a sorte do jogador. Isso dá aos personagens dos jogadores um token de sorte normal e rola um número de tokens para o Modo Pulp. </ul><h1>v.1.4.8</h1> <h2>Correções de bugs</h2> <ul><li>[#526] Macros de início rápido usando caminhos de compêndio incorretos</li><li>[#535] Propriedades de armas não migradas nos compêndios causavam problemas ao abrir fichas de personagens quando adicionadas a elas</li><li>[#540] Mover macros relacionadas à aventura de início rápido para o pacote de aventura, pois elas não funcionam sem essa importação de qualquer maneira</li></ul> Muito obrigado à Prototype por contribuir com as correções incluídas nesta versão. <h1>v.1.4.7</h1> <h2>Correções de bugs</h2> <ul><li>[#530] O mapeamento de arte de fichas do Pathfinder Token Pack: módulo Bestiaries não está funcionando</li><li><p>[#531] Bônus de ataque ausentes nos seguintes talentos</p><ul> +1 para ataques corpo a corpo e dano <li>+1 para ataques à distância e dano</li></ul></li></ul> <h2>Melhorias</h2> <ul><li>[#527] Novo efeito predefinido que adicionará bônus de atributos selecionados à CA (se positivos)</li> Adicionar efeito integrado para suportar a melhoria dos dados de dano da arma através da correspondência das propriedades da arma <li>[#529] Adicionar efeito predefinido que aumenta a CA se nenhuma armadura for usada</li></ul><h1>v.1.4.6</h1><h2>Correções de bugs</h2><ul><li>[#485] O talento Vantagem Mágica não está funcionando</li><li>[#521] Não é possível adicionar os talentos Weapon e Armor Mastery à ficha do personagem</li></ul> <h2>Melhorias</h2> <ul><li>[#520] Mudança da configuração de rolagem de HP da classe para um campo de texto livre, para que fórmulas personalizadas de rolagem de dados possam ser usadas</li> Adicionada a caixa de seleção “Todas as armas de longo alcance“ e “Todas as armas corpo a corpo“ às configurações de equipamento da classe para opções mais detalhadas. </ul><h1>v.1.4.5</h1><h2>Correções de bugs</h2><ul><li>[#515] Opção de golpe pelas costas indisponível em jogadas de ataque</li><li>[#516] As fichas de itens Varinha e Pergamino não mostravam corretamente as classes de conjuradores de feitiços</li></ul> <h2>Melhorias</h2> <ul><li>[#499] Adicionar suporte para bênçãos e seus vários subtipos</li><li>[#517] Adicionar suporte para habilidades de classe de uso limitado e habilidades de classe sem jogadas associadas</li><li>[#518] Domínio de armas e armaduras usando armas básicas fixas em vez de criar dinamicamente uma lista a partir de itens disponíveis em compêndios</li></ul><h1>v.1.4.4</h1> <h2>Correções de bugs</h2> <ul> Seletores de itens do compêndio precisam de IDs exclusivas para garantir que mostrem a seleção correta </ul><h1>v.1.4.3</h1><p><strong>NOTA:</strong> Se você tiver compêndios em seus mundos, será necessário migrar novamente um backup anterior à versão 1.4.0 do seu mundo após a instalação desta versão para garantir que a migração seja feita corretamente.</p><h2>Correções de bugs</h2><ul><li>[#508] Falha na migração de compêndios da versão 1.3.7 para a 1.4.0</li></ul><h1>v.1.4.2</h1><p>** Apenas uma atualização de versão **</p><h1>v.1.4.1</h1><p>** Lançamento retirado devido a erros de empacotamento **</p><h1>v.1.4.0</h1><h2>Correções de bugs</h2><ul><li>[#431] O efeito ativo da Armadura do Mago não altera a CA</li><li>[#476] Bônus de ataque ausentes dos monstros</li><li>[#482] Não é possível criar ou importar efeitos ativos quando não se está em combate</li><li>[#483] O texto secreto não funciona corretamente</li><li>[#486] Corrigido erro ortográfico na Tabela de Itens Mágicos 1, Resultado 20</li><li>[#488] Correções para portas trancadas e monstros ausentes na aventura A Cidadela Perdida do Minotauro Escarlate</li><li>[#493] Item do compêndio “Espada dos Antigos“ sem tipo de arma base</li><li>[#496] Efeito do feitiço Armadura do Mago não sendo aplicado</li></ul> <h2>Melhorias</h2> <ul> Adicionada a capacidade de ampliar várias opções de personagens. <li>[#374] Adicionada a capacidade de criar classes personalizadas</li><li>[#375] Adicionado suporte para ancestrais personalizados</li> Adicionado suporte para habilidades de classe roláveis Identificar idiomas “raros“ no seletor de idiomas para auxiliar na seleção Adicionada a capacidade de acessar facilmente itens filtrados do compêndio Adicionada a classe Bardo <li>[#449] Suporte a bônus de bardo exportados por ShadowDarklings</li> Adicionada a capacidade de criar propriedades personalizadas para armas e armaduras. Adicionada condição para a habilidade de invisibilidade “Furtivo“ do Halfling. <li>[#491] Adicionado suporte para idiomas personalizados</li> Adicionado suporte para itens de fundo personalizados Adicionado suporte para itens de divindades. <li>[#497] Divisão das notas da ficha de personagem em uma guia separada</li><li>[#498] Corrigidos os controles do cabeçalho e da guia da ficha de personagem na parte superior da janela da ficha de personagem</li><li>[#501] Atualização do importador ShadowDarklings para usar novos itens de fundo de personagem</li></ul><h1>v.1.3.7</h1><h2>Correções de bugs</h2><ul><li>[#472] Melhorar o tratamento de situações em que a habilidade de conjuração de feitiços não está definida</li><li>[#473] Rolagem de dano incorreta quando apenas o dano 2H está definido</li></ul> <h2>Melhorias</h2> <ul> Adicionadas opções de movimento adicionais para NPCs (Nenhuma, Longe e Especial). </ul><h2>Correções de bugs</h2><ul><li>[#470] As mensagens de sucesso/falha no chat são exibidas apenas uma vez</li></ul><h1>v.1.3.6</h1><h2>Correções de bugs</h2><ul><li>[#466] O HP do NPC com rolagem automática agora aplica corretamente o HP ao NPC</li></ul><h1>v.1.3.5</h1><p>Damos as boas-vindas a @gatesvp como colaborador do sistema!</p><h2>Correções de bugs</h2><ul><li>[#452] Encaminha o rastreador de problemas para o rastreador de problemas real, em vez do repositório</li><li>[#450] O HP do NPC agora adiciona corretamente o bônus de mod CON (mínimo 1) ao HP</li><li>[#461] Permite que jogadores com permissão de edição acessem o menu de contexto dos itens de um personagem para editar e excluir</li><li>[#462] Aguardando corretamente a criação de efeitos ativos para compatibilidade com a V11</li></ul> <h2>Melhorias</h2> <ul> Adicionado ataque especial ao cartão de bate-papo quando aplicável. <li>[#277] A implementação parcial fornece uma maneira rápida de aplicar danos e curas diretamente do cartão de bate-papo</li><li>[#311] Campo de iniciativa nas fichas do PC</li></ul><h1>v.1.3.4</h1><h2>Melhorias</h2><ul><li>[#443] Adicionados bônus de ascendência kobold, compatível com importação de Shadowdarkling</li></ul><h1>v.1.3.3</h1><h2>Correções de bugs</h2><ul><li>[#427] O tour para o rastreador de fonte de luz agora funciona novamente</li><li>[#432] O tour para a mecânica de lançamento de dados agora funciona novamente</li></ul> <h2>Melhorias</h2> <ul><li>[#435] Sistema totalmente traduzido para coreano e finlandês</li></ul><h1>v.1.3.2</h1><h2>Correções de erros</h2><ul><li>[#419] Shadowdarklings.net usa https em vez de http</li><li>[#420] Os ataques dos NPCs agora também incluem o bônus de dano</li><li>[#422] Personagens com bônus de estatísticas de habilidade agora são importados corretamente</li><li>[#428] Verificado com o Foundry v11</li></ul><h1>v.1.3.1</h1> <h2>Correções de bugs</h2> <ul><li>[#407] Novos idiomas agora estão ativados e disponíveis no jogo</li><li>[#411] O valor da duração não aparecia na ficha dos itens Poção, Pergamino e Varinha</li><li>[#413] As durações dos efeitos agora são atualizadas ao alterar os valores de duração na ficha, e as condições temporárias são removidas ao expirar</li> Agora captura efeitos que fornecem fonte de luz usando o nome ou se alguma alteração estiver manipulando o campo do modelo de luz. </ul><h2>Errata</h2><li>[#412] Atualizou os itens do Ranger para a versão mais recente</li><li>[#415] Aplicar a última errata do Shadowdark V2 onde necessário</li></ul><hr><h1>v1.3.0</h1><h2>Correções de bugs</h2><ul><li>[#319] Menu de contexto do botão direito do mouse vinculado a links de guias nas fichas de personagens</li><li>[#321] Agora podemos adicionar efeitos de bônus de CA aos itens</li><li>[#325] Os bônus de Domínio de Armas agora funcionam como pretendido</li><li>[#336] A migração de dados sempre é executada para novos mundos na primeira vez em que são abertos</li><li>[#341] A tabela de Acidentes Mágicos Nível 1-2 agora se repete duas vezes em um 1</li><li>[#350] Os lançamentos em linha das características dos NPCs agora são renderizados corretamente</li><li>[#322] O frasco ou garrafa tinha um erro de digitação no custo nos testes do Shadowdarkling</li><li>[#358] Descrição do feitiço Sleep atualizada de acordo com a errata</li><li>[#394] Arrastar uma luz de uma ficha de personagem para outra deve excluí-la do proprietário original</li><li>[#396] Fontes de luz descartadas mantêm seu status ativo</li></ul> <h2>Melhorias</h2> <ul><li>[#23] Em conjunto com [#329], adicionar suporte para itens de varinha com dados de feitiço associados e capacidade de uso a partir do inventário/cartas de bate-papo de itens</li><li>[#192] Use a hora mundial para o Light Tracker a fim de facilitar o uso das ferramentas de ajuste de calendário/hora. Permite o avanço do tempo através do uso de módulos de manipulação de hora mundial de terceiros, como <a href=“https://foundryvtt.com/packages/foundryvtt-simple-calendar“>Simple Calendar</a>, etc.</li> Melhorias no importador Shadowdarklings, com quadro no jogo para facilitar o acesso. <li>[#306] Criação de compêndios a partir de dados de origem no momento da compilação</li><li>[#309] Comportamento mais consistente ao clicar nos ícones de itens na ficha do personagem. Agora eles publicam o item no chat, e o item do chat tem botões para realizar ações relevantes</li><li>[#310] Clicar nos nomes dos itens do inventário, feitiços e talentos na ficha do personagem do jogador agora revela informações sobre esse item, juntamente com botões para realizar ações relevantes</li><li>[#329] Promove os itens básicos Pergaminhos de Feitiço a itens completos por direito próprio e fornece a capacidade de aprender feitiços a partir dos pergaminhos.</li><li><p>[#338] Revisão completa dos efeitos:</p><ul> Introduzir itens de efeito que vêm em dois tipos, “condição“ e “efeito“. Introdução do Painel de Efeitos, que mostrará efeitos temporários (e passivos, se a configuração estiver marcada). <li> Agora usa listas de dados em vez de janelas pop-up para determinar os tipos de efeito, tornando-os pesquisáveis <ul> Selecionar um tipo de efeito que requer entrada do usuário agora solicitará essa entrada (por exemplo, Domínio de Armas e Armaduras + Vantagem de Feitiço). Adicionar um talento/efeito que requer entrada solicitará ao usuário que escolha ao arrastar para a folha. </ul></li><li>Rastreamento de tempo, incluindo rastreamento de rodadas de efeitos temporários.</li><li>Limpeza automática de efeitos expirados.</li> Efeitos ativos estão prontos para a V11 <li>[#317] Os usuários do Foundry v10 agora serão impedidos de editar efeitos se forem propriedade do ator. Para a V11, isso é permitido, pois o banco de dados permite tais operações.</li> Adicionados efeitos de fonte de luz que funcionam como fontes de luz anteriores. Adicionados efeitos multiplicadores de dano para atores (devem ser usados apenas como efeitos temporários) e itens (podem ser permanentes). </ul><li>[#338] Adicionado um compêndio de condições com condições arrastáveis. [#266]</li> Adiciona “Ilimitado“ como uma opção para Alcances de Feitiços. <li>[#348] Adiciona valores de configuração ausentes para movimento de NPCs, alcances de feitiços e durações de feitiços (#346, #347)</li><li>[#353] Shadowdarkling agora testa itens básicos para ter o custo correto</li> Adicionado coreano como idioma do sistema totalmente traduzido, graças a (Twitter: @momslastson). Adicionamos mapeamentos de fontes de luz para facilitar a adição de novos tipos de fontes de luz. Adicionado Encontro Aleatório: Tabela de Reação, bem como uma Macro para ajudar a extrair informações das tabelas e resumir em uma mensagem de chat. Adicionado script de macro (não macro no jogo) para criar uma macro de Carousing com tabela de rolagem de Carousing no jogo. Adicionado Foundry VTT CLI aos scripts npm para permitir compilações CI de pacotes de compêndios para v11+ e versões anteriores. Adicionada mensagem de aviso à interface do Light Tracker quando há usuários que não selecionaram um personagem. Adicionada a capacidade de rastrear/controlar fontes de luz de efeito ativo baseadas em ator no Light Tracker. Adiciona um ator de luz que é usado apenas para soltar uma fonte de luz em uma cena e permite que ela seja recolhida novamente. A fonte de luz solta continuará sendo rastreada pelo rastreador de fontes de luz. <li>[#392] Arte oficial da tela do GM adicionada como imagem de fundo padrão do login do mundo (agradecemos a Kelsey por nos dar permissão para usar esta arte incrível)</li><li>[#393] Suporte para a classe Ranger, incluindo importação do Shadowdarklings.net. Permite que o GM selecione fontes de luz para usuários se eles estiverem conectados e tiverem um personagem atribuído. Mostrar todos os atores que têm um ou mais usuários com permissões de proprietário no Light Tracker. <ul><li>Também adiciona uma opção ao Light Tracker para mostrar/ocultar atores sem fonte de luz ativa</li></ul></li></ul><hr><h1>v1.2.4</h1><h2>Correções de bugs</h2><ul><li>[#313] Corrigido um erro ortográfico nos livros, onde frascos e garrafas custam 3 GP em vez de SP</li></ul><hr><h1>v1.2.3</h1><h2>Correções de erros</h2><ul><li>[#292] Clicar em um item rolável na tela do inventário aciona duas caixas de diálogo</li><li>[#294] O jogador rola barracas de turismo devido ao fato de ocultarmos a guia de lançamento de feitiços para não conjuradores</li><li>[#296] Colocar um monstro com HP de NPC com rolagem automática causa várias rolagens de HP</li><li>[#297] Os personagens pré-criados do Quickstart têm todos zero pontos de vida atuais</li></ul><hr><h1>v1.2.2</h1><h2>Correções de bugs</h2><ul><li>[#288] Impossível realizar ataques usando os atalhos de Ataque/Ações</li></ul><hr><h1>v1.2.1</h1><h2>Correções de bugs</h2><ul><li>[#283] Etiquetas de atributos ausentes na folha NPC</li></ul><hr><h1>v1.2.0</h1><h2>Correções de bugs</h2><ul><li>[#75] Implementa os talentos de Domínio da Armadura corretamente</li><li>[#110] Garante que edições manuais nos valores dos atributos após a aplicação de Efeitos Ativos a um personagem não resultem em valores incorretos</li><li>[#244] A opção “Rastrear fontes de luz de usuários inativos“ não atualiza imediatamente a interface do Rastreador de Luz</li><li>[#249] Alguns tamanhos padrão de fichas não estão corretos no pacote de monstros</li><li>[#261] As dicas de ferramenta do botão Criar Item não funcionam nas folhas de personagens e NPCs. Sempre exibe o campo de propriedades para itens mágicos e talentos <li>[#267] Erro de digitação na etapa 21 do tour da fonte de luz</li><li>[#268] Talentos <code>acBonus</code> removidos. <strong>ATENÇÃO</strong>: Os usuários que já escolheram o talento Bônus de Armadura precisam escolhê-lo novamente.</li><li>[#269] Corrigimos pontuações de habilidade incorretas em alguns personagens pré-criados. <li>[#274] Alterações na forma como armazenamos as pontuações de habilidade danificaram o importador de personagens</li></ul> <h2>Melhorias</h2> <ul><li>[#147] Ocultar a guia Feitiços na ficha de personagem para classes que não podem lançar feitiços.</li><li>[#170] Usar dinamicamente tokens do módulo PF2e Bestiary se os usuários o tiverem instalado/ativado (também oferece suporte para pacotes de tokens adicionais no futuro). Requer o módulo <a href=“https://foundryvtt.com/packages/pf2e-tokens-bestiaries“>Pathfinder Token Pack: Bestiaries</a> v1.0.5 ou superior d .</li><li>[#187] Desativar a exploração de neblina no mapa The Lost Citadel</li> Adicionar a capacidade de importar personagens criados no gerador de personagens ShadowDarklings. <li>[#213] Tornar os modificadores de habilidade do PC disponíveis para jogadas programadas. Agora eles estarão disponíveis como <code>@abilities.[ability].mod</code>, por exemplo <code>@abilities.str.mod</code>, etc.</li><li>[#219] Opcionalmente, role os pontos de vida dos NPCs quando eles forem adicionados a uma cena</li> Permitir a abertura da ficha do personagem clicando no retrato no rastreador de luz. Adicionar mensagem de boas-vindas do sistema indicando que temos tours disponíveis Adiciona testes completos para o Rastreador de Luz <li>[#242] Adiciona um tour guiado para rolar a partir da ficha do personagem do jogador</li> Adiciona um tour guiado para importar a Cidadela Perdida do Minotauro Escarlate para o mundo. Adiciona testes para garantir que o compêndio de monstros não altere os IDs, pois isso prejudicaria a integração com o módulo de tokens do bestiário PF2e. <li>[#254] Adiciona uma mensagem de boas-vindas ao iniciar o sistema pela primeira vez, referindo-se aos tours e ao rastreador de problemas</li><li>[#256] Adiciona a criação de pergaminhos de feitiços (arraste um feitiço para o inventário do jogador) e o enrolamento do pergaminho se o jogador for um lançador de feitiços (clique no ícone do pergaminho)</li><li>[#270] Adiciona contribuições para sueco, finlandês, alemão e francês do <a href=“https://crowdin.com/project/shadowdark-rpg-for-foundry-vtt“>Crowdin</a></li><li>[#271] Ajustes para o importador Shadowdarkling e testes de planilha para compatibilidade com a v11</li></ul><hr><h1>v1.1.2</h1><h2>Correções de bugs</h2><ul><li>[#227] Revertida a automação do HP Rolling. Em vez disso, foi adicionado um botão “Aplicar HP Roll ao HP máximo“ no cartão HP roll. Todas as modificações de HP agora são manuais (exceto bônus de talento).</li><li>[#232] Martin Rast tinha um dex incorreto nos personagens pré-gerados.</li><li>[#236] Não ofereça adicionar HP ao máximo para NPCs, apenas altere automaticamente o HP máximo para o resultado rolado.</li></ul> <h2>Melhorias</h2> <ul> Adicionada a localização da macro para o tour do rastreador de fonte de luz. </ul><hr><h1>v1.1.1</h1><h2>Correções de bugs</h2><ul><li>[#209] Itens em compêndios do sistema bloqueados parcialmente editáveis</li><li>[#221] O tour do rastreador de fonte de luz agora exige que o rastreador esteja ativado, caso contrário, exibe um aviso. Também armazena e restaura as configurações originais (supondo que o usuário não reinicie o mundo ou o tour em um intervalo de 10 minutos).</li><li>[#222] O HP contínuo para um personagem de nível 1 recém-criado falha se a entrada da classe for deixada no padrão</li></ul><hr><h1>v1.1.0</h1> <h2>Correções de bugs</h2> <ul><li>[#185] Refatoração do HP e atualização do esquema para corrigir problemas de HP em PCs</li><li>[#199] Alternar uma fonte de luz gera um erro sem um token na cena</li><li>[#201] Mensagens de chat perdidas de eventos do rastreador de luz devido a erros gerados</li><li>[#202] O erro gerado impedia que a luz fosse atualizada no token</li><li>[#207] Corrige o problema em que o item era excluído antes que a luz pudesse ser ativada</li><li>[#208] Menu de contexto do item da ficha de personagem não funcionando para usuários que não são GM</li><li>[#210] Possível condição de corrida no Light Tracker</li><li>[#214] O lançador de dados não respeitava o modo de lançamento solicitado</li></ul> <h2>Melhorias</h2> <ul><li>[#139] Adicionado Guia para explicar o Rastreador de Fonte de Luz</li><li>[#190] Adicionado HP rolando para jogadores por nível, incluindo migração de dados</li><li>[#195] Adicionado recarregamento instantâneo do gulp para desenvolvedores</li><li>[#196] Adicionado teste do Rastreador de fonte de luz</li><li>[#198] & [#216] Adicionadas atualizações i18n contribuídas para tradução em alemão, finlandês e francês</li><li>[#211] Aumento da granularidade dos intervalos do Light Tracker, conforme permitido pelas melhorias de desempenho</li> Várias pequenas alterações no CSS e no layout da ficha de personagem </ul><hr><h1>v1.0.2</h1><h2>Correções de bugs</h2><ul><li>[#189] Quando um efeito personalizado era renomeado, ocorria um erro que impedia a abertura do aplicativo seletor</li></ul> <h2>Melhorias</h2> <ul><li>[#188] Adicionadas atualizações i18n contribuídas para os idiomas finlandês, alemão e sueco</li></ul><hr><h1>v1.0.1</h1><h2>Correções de bugs</h2><ul><li>[#178] Corrigido o problema de exibição de NaN com ataques à distância</li></ul><hr><h1>v1.0.0</h1><p>Versão inicial.</p>"
				}
			}
		}
	}
}